[
  {
    "case_name": "Justice K.S. Puttaswamy (Retd.) v. Union of India",
    "citation": "AIR 2017 SC 4161",
    "year": 2017,
    "bench": "9 Judge Bench",
    "full_text": "A batch of petitions challenged the constitutional validity of the Aadhaar scheme. The primary question was whether the right to privacy is a fundamental right under the Constitution of India. The petitioners argued that the mandatory linking of Aadhaar with various services violated the right to privacy. The Supreme Court held that the right to privacy is an intrinsic part of Article 21 and Part III of the Constitution. It is a fundamental right that inheres in every individual. The Court overruled the decisions in M.P. Sharma and Kharak Singh to the extent they held that the right to privacy is not protected under the Constitution.",
    "source_url": "https://indiankanoon.org/doc/127517806/"
  },
  {
    "case_name": "Kesavananda Bharati Sripadagalvaru v. State of Kerala",
    "citation": "AIR 1973 SC 1461",
    "year": 1973,
    "bench": "13 Judge Bench",
    "full_text": "The petitioner challenged the Kerala Land Reforms Act and amendments to the Constitution. The core issue was whether Parliament's power to amend the Constitution is unlimited. The Supreme Court propounded the basic structure doctrine, holding that Parliament can amend any part of the Constitution but cannot alter its basic structure. The basic structure includes supremacy of the Constitution, republican and democratic form of government, secular character, separation of powers, and federal character. This landmark judgment limited the amending power of Parliament.",
    "source_url": "https://indiankanoon.org/doc/257876/"
  },
  {
    "case_name": "Bachan Singh v. State of Punjab",
    "citation": "AIR 1980 SC 898",
    "year": 1980,
    "bench": "5 Judge Bench",
    "full_text": "The constitutionality of the death penalty under Section 302 IPC and Section 354(3) CrPC was challenged. The Supreme Court upheld the death penalty but restricted its application to the rarest of rare cases. The Court laid down that the death sentence should be imposed only when the alternative option of life imprisonment is unquestionably foreclosed. The Court must consider both aggravating and mitigating circumstances. This case established the rarest of rare doctrine for capital punishment in India.",
    "source_url": "https://indiankanoon.org/doc/1034945/"
  },
  {
    "case_name": "Maneka Gandhi v. Union of India",
    "citation": "AIR 1978 SC 597",
    "year": 1978,
    "bench": "7 Judge Bench",
    "full_text": "The petitioner's passport was impounded by the government under the Passport Act. The Supreme Court expanded the scope of Article 21, holding that the right to life and personal liberty cannot be deprived except according to procedure established by law, and such procedure must be fair, just and reasonable. The Court also held that Articles 14, 19 and 21 are not mutually exclusive but form a golden triangle. This case revolutionized the interpretation of fundamental rights.",
    "source_url": "https://indiankanoon.org/doc/1766147/"
  },
  {
    "case_name": "Vishaka v. State of Rajasthan",
    "citation": "AIR 1997 SC 3011",
    "year": 1997,
    "bench": "3 Judge Bench",
    "full_text": "A petition was filed after the gang rape of a social worker. The Supreme Court laid down guidelines for preventing sexual harassment at the workplace. The Court held that gender equality includes protection from sexual harassment and the right to work with dignity under Articles 14, 15, 19 and 21. The Vishaka Guidelines were issued as law until appropriate legislation was enacted. This led to the Sexual Harassment of Women at Workplace Act, 2013.",
    "source_url": "https://indiankanoon.org/doc/1031794/"
  },
  {
    "case_name": "Olga Tellis v. Bombay Municipal Corporation",
    "citation": "AIR 1986 SC 180",
    "year": 1986,
    "bench": "5 Judge Bench",
    "full_text": "Pavement dwellers in Bombay challenged their eviction. The Supreme Court held that the right to livelihood is an integral part of the right to life under Article 21. The Court observed that to make the right to life meaningful, it must include the right to livelihood. No one can live without the means of living. The eviction of pavement dwellers without providing alternative accommodation would deprive them of their right to livelihood.",
    "source_url": "https://indiankanoon.org/doc/702360/"
  },
  {
    "case_name": "Mohd. Ahmed Khan v. Shah Bano Begum",
    "citation": "AIR 1985 SC 945",
    "year": 1985,
    "bench": "5 Judge Bench",
    "full_text": "A divorced Muslim woman sought maintenance under Section 125 CrPC. The Supreme Court held that a Muslim husband is liable to provide maintenance to his divorced wife beyond the iddat period under the Code of Criminal Procedure. The Court interpreted Muslim personal law and held that the Quran imposes an obligation on the husband to provide for the divorced wife. This judgment sparked significant debate on uniform civil code and led to the Muslim Women (Protection of Rights on Divorce) Act, 1986.",
    "source_url": "https://indiankanoon.org/doc/823221/"
  },
  {
    "case_name": "S.R. Bommai v. Union of India",
    "citation": "AIR 1994 SC 1918",
    "year": 1994,
    "bench": "9 Judge Bench",
    "full_text": "The case arose from the dismissal of state governments under Article 356. The Supreme Court held that secularism is a basic feature of the Constitution. The power of the President to impose President's Rule is subject to judicial review. The Court laid down that the floor of the Assembly is the only place to test the majority of the government. This case strengthened federalism and limited the misuse of Article 356.",
    "source_url": "https://indiankanoon.org/doc/60799/"
  },
  {
    "case_name": "Indra Sawhney v. Union of India",
    "citation": "AIR 1993 SC 477",
    "year": 1993,
    "bench": "9 Judge Bench",
    "full_text": "The constitutionality of reservations for Other Backward Classes in government jobs was challenged. The Supreme Court upheld the Mandal Commission recommendations with modifications. The Court held that caste can be a factor for identifying backward classes. Reservations should not exceed 50 percent. The creamy layer should be excluded from reservations. There should be no reservation in promotions. This case shaped India's reservation policy.",
    "source_url": "https://indiankanoon.org/doc/1363234/"
  },
  {
    "case_name": "Navtej Singh Johar v. Union of India",
    "citation": "AIR 2018 SC 4321",
    "year": 2018,
    "bench": "5 Judge Bench",
    "full_text": "A petition challenged Section 377 of the Indian Penal Code which criminalized consensual homosexual acts. The Supreme Court held that Section 377 in so far as it criminalizes consensual sexual conduct between adults in private is unconstitutional. The Court held that sexual orientation is an essential attribute of privacy and discrimination on the basis of sexual orientation violates the right to equality. The LGBTQ+ community is entitled to equal citizenship and equal protection of laws.",
    "source_url": "https://indiankanoon.org/doc/168671544/"
  }
]
