[
  {
    "case_name": "Justice K.S. Puttaswamy (Retd.) v. Union of India",
    "citation": "AIR 2017 SC 4161",
    "year": 2017,
    "bench": "9 Judge Bench",
    "full_text": "A batch of petitions challenged the constitutional validity of the Aadhaar scheme. The primary question was whether the right to privacy is a fundamental right under the Constitution of India. The petitioners argued that the mandatory linking of Aadhaar with various services violated the right to privacy. The Supreme Court held that the right to privacy is an intrinsic part of Article 21 and Part III of the Constitution. It is a fundamental right that inheres in every individual. The Court overruled the decisions in M.P. Sharma and Kharak Singh to the extent they held that the right to privacy is not protected under the Constitution.",
    "source_url": "https://indiankanoon.org/doc/127517806/"
  },
  {
    "case_name": "Kesavananda Bharati Sripadagalvaru v. State of Kerala",
    "citation": "AIR 1973 SC 1461",
    "year": 1973,
    "bench": "13 Judge Bench",
    "full_text": "The petitioner challenged the Kerala Land Reforms Act and amendments to the Constitution. The core issue was whether Parliament's power to amend the Constitution is unlimited. The Supreme Court propounded the basic structure doctrine, holding that Parliament can amend any part of the Constitution but cannot alter its basic structure. The basic structure includes supremacy of the Constitution, republican and democratic form of government, secular character, separation of powers, and federal character. This landmark judgment limited the amending power of Parliament.",
    "source_url": "https://indiankanoon.org/doc/257876/"
  },
  {
    "case_name": "Bachan Singh v. State of Punjab",
    "citation": "AIR 1980 SC 898",
    "year": 1980,
    "bench": "5 Judge Bench",
    "full_text": "The constitutionality of the death penalty under Section 302 IPC and Section 354(3) CrPC was challenged. The Supreme Court upheld the death penalty but restricted its application to the rarest of rare cases. The Court laid down that the death sentence should be imposed only when the alternative option of life imprisonment is unquestionably foreclosed. The Court must consider both aggravating and mitigating circumstances. This case established the rarest of rare doctrine for capital punishment in India.",
    "source_url": "https://indiankanoon.org/doc/1034945/"
  },
  {
    "case_name": "Maneka Gandhi v. Union of India",
    "citation": "AIR 1978 SC 597",
    "year": 1978,
    "bench": "7 Judge Bench",
    "full_text": "The petitioner's passport was impounded by the government under the Passport Act. The Supreme Court expanded the scope of Article 21, holding that the right to life and personal liberty cannot be deprived except according to procedure established by law, and such procedure must be fair, just and reasonable. The Court also held that Articles 14, 19 and 21 are not mutually exclusive but form a golden triangle. This case revolutionized the interpretation of fundamental rights.",
    "source_url": "https://indiankanoon.org/doc/1766147/"
  },
  {
    "case_name": "Vishaka v. State of Rajasthan",
    "citation": "AIR 1997 SC 3011",
    "year": 1997,
    "bench": "3 Judge Bench",
    "full_text": "A petition was filed after the gang rape of a social worker. The Supreme Court laid down guidelines for preventing sexual harassment at the workplace. The Court held that gender equality includes protection from sexual harassment and the right to work with dignity under Articles 14, 15, 19 and 21. The Vishaka Guidelines were issued as law until appropriate legislation was enacted. This led to the Sexual Harassment of Women at Workplace Act, 2013.",
    "source_url": "https://indiankanoon.org/doc/1031794/"
  },
  {
    "case_name": "Olga Tellis v. Bombay Municipal Corporation",
    "citation": "AIR 1986 SC 180",
    "year": 1986,
    "bench": "5 Judge Bench",
    "full_text": "Pavement dwellers in Bombay challenged their eviction. The Supreme Court held that the right to livelihood is an integral part of the right to life under Article 21. The Court observed that to make the right to life meaningful, it must include the right to livelihood. No one can live without the means of living. The eviction of pavement dwellers without providing alternative accommodation would deprive them of their right to livelihood.",
    "source_url": "https://indiankanoon.org/doc/702360/"
  },
  {
    "case_name": "Mohd. Ahmed Khan v. Shah Bano Begum",
    "citation": "AIR 1985 SC 945",
    "year": 1985,
    "bench": "5 Judge Bench",
    "full_text": "A divorced Muslim woman sought maintenance under Section 125 CrPC. The Supreme Court held that a Muslim husband is liable to provide maintenance to his divorced wife beyond the iddat period under the Code of Criminal Procedure. The Court interpreted Muslim personal law and held that the Quran imposes an obligation on the husband to provide for the divorced wife. This judgment sparked significant debate on uniform civil code and led to the Muslim Women (Protection of Rights on Divorce) Act, 1986.",
    "source_url": "https://indiankanoon.org/doc/823221/"
  },
  {
    "case_name": "S.R. Bommai v. Union of India",
    "citation": "AIR 1994 SC 1918",
    "year": 1994,
    "bench": "9 Judge Bench",
    "full_text": "The case arose from the dismissal of state governments under Article 356. The Supreme Court held that secularism is a basic feature of the Constitution. The power of the President to impose President's Rule is subject to judicial review. The Court laid down that the floor of the Assembly is the only place to test the majority of the government. This case strengthened federalism and limited the misuse of Article 356.",
    "source_url": "https://indiankanoon.org/doc/60799/"
  },
  {
    "case_name": "Indra Sawhney v. Union of India",
    "citation": "AIR 1993 SC 477",
    "year": 1993,
    "bench": "9 Judge Bench",
    "full_text": "The constitutionality of reservations for Other Backward Classes in government jobs was challenged. The Supreme Court upheld the Mandal Commission recommendations with modifications. The Court held that caste can be a factor for identifying backward classes. Reservations should not exceed 50 percent. The creamy layer should be excluded from reservations. There should be no reservation in promotions. This case shaped India's reservation policy.",
    "source_url": "https://indiankanoon.org/doc/1363234/"
  },
  {
    "case_name": "Navtej Singh Johar v. Union of India",
    "citation": "AIR 2018 SC 4321",
    "year": 2018,
    "bench": "5 Judge Bench",
    "full_text": "A petition challenged Section 377 of the Indian Penal Code which criminalized consensual homosexual acts. The Supreme Court held that Section 377 in so far as it criminalizes consensual sexual conduct between adults in private is unconstitutional. The Court held that sexual orientation is an essential attribute of privacy and discrimination on the basis of sexual orientation violates the right to equality. The LGBTQ+ community is entitled to equal citizenship and equal protection of laws.",
    "source_url": "https://indiankanoon.org/doc/168671544/"
  },
  {
    "case_name": "M.C. Mehta v. Union of India (Oleum Gas Leak Case)",
    "citation": "AIR 1987 SC 1086",
    "year": 1987,
    "bench": "5 Judge Bench",
    "full_text": "Following a gas leak from the Shriram Food and Fertilizer Complex in Delhi, a public interest litigation was filed. The Supreme Court propounded the doctrine of absolute liability, going beyond the rule in Rylands v. Fletcher. The Court held that an enterprise engaged in a hazardous or inherently dangerous industry owes an absolute duty to the community to ensure that no harm results. The measure of compensation must be proportional to the magnitude and capacity of the enterprise. This case strengthened environmental jurisprudence in India.",
    "source_url": "https://indiankanoon.org/doc/1486949/"
  },
  {
    "case_name": "Indian Council for Enviro-Legal Action v. Union of India",
    "citation": "AIR 1996 SC 1446",
    "year": 1996,
    "bench": "3 Judge Bench",
    "full_text": "Villages near chemical industrial plants in Rajasthan suffered severe environmental damage from untreated toxic sludge. The Supreme Court applied the polluter pays principle and the precautionary principle, holding that polluting industries must compensate affected communities and restore environmental damage. The Court directed the closure of polluting units and held the government responsible for enforcing environmental regulations. This case established key environmental law principles in Indian jurisprudence.",
    "source_url": "https://indiankanoon.org/doc/1818014/"
  },
  {
    "case_name": "Bandhua Mukti Morcha v. Union of India",
    "citation": "AIR 1984 SC 802",
    "year": 1984,
    "bench": "3 Judge Bench",
    "full_text": "A public interest litigation was brought on behalf of bonded laborers in stone quarries of Haryana. The Supreme Court expanded the scope of Article 21 to include the right to live with human dignity, free from exploitation. The Court held that bonded labor is a violation of fundamental rights under Articles 21 and 23 of the Constitution. The Court directed the state to identify, release, and rehabilitate bonded laborers. This case was pivotal in broadening the concept of locus standi in PIL.",
    "source_url": "https://indiankanoon.org/doc/595099/"
  },
  {
    "case_name": "D.K. Basu v. State of West Bengal",
    "citation": "AIR 1997 SC 610",
    "year": 1997,
    "bench": "2 Judge Bench",
    "full_text": "A letter petition was sent regarding custodial deaths and torture. The Supreme Court laid down 11 mandatory requirements for police officers during arrest and detention. These include informing relatives, maintaining a memo of arrest, right to legal counsel, and medical examination every 48 hours. The Court held that custodial torture and death violate Article 21. The guidelines have the force of law and any violation would render the officer liable for contempt and departmental action.",
    "source_url": "https://indiankanoon.org/doc/501198/"
  },
  {
    "case_name": "Hussainara Khatoon v. Home Secretary, State of Bihar",
    "citation": "AIR 1979 SC 1369",
    "year": 1979,
    "bench": "2 Judge Bench",
    "full_text": "The case highlighted the plight of thousands of undertrial prisoners in Bihar languishing in jails for periods longer than the maximum sentence for their alleged offences. The Supreme Court held that the right to speedy trial is a fundamental right under Article 21. The Court also established the right to free legal aid as a fundamental right for those who cannot afford legal representation. This case led to the release of thousands of undertrial prisoners and laid the foundation for legal aid in India.",
    "source_url": "https://indiankanoon.org/doc/1373215/"
  },
  {
    "case_name": "Unni Krishnan J.P. v. State of Andhra Pradesh",
    "citation": "AIR 1993 SC 2178",
    "year": 1993,
    "bench": "5 Judge Bench",
    "full_text": "The case challenged the commercialization of education through capitation fees charged by private professional colleges. The Supreme Court held that the right to education is a fundamental right flowing from Article 21, at least up to the age of 14 years. The Court devised a scheme to regulate admissions and fees in private unaided professional colleges. This case was instrumental in later constitutional amendments making education a fundamental right under Article 21-A.",
    "source_url": "https://indiankanoon.org/doc/1775396/"
  },
  {
    "case_name": "Minerva Mills Ltd. v. Union of India",
    "citation": "AIR 1980 SC 1789",
    "year": 1980,
    "bench": "5 Judge Bench",
    "full_text": "The case challenged the 42nd Amendment which had given Parliament unlimited amending power and barred judicial review. The Supreme Court struck down Sections 4 and 55 of the 42nd Amendment as unconstitutional. The Court held that the harmony between fundamental rights and directive principles is a basic feature of the Constitution. Judicial review is an integral part of the basic structure and cannot be taken away. The case reaffirmed the basic structure doctrine established in Kesavananda Bharati.",
    "source_url": "https://indiankanoon.org/doc/1939993/"
  },
  {
    "case_name": "Shayara Bano v. Union of India",
    "citation": "(2017) 9 SCC 1",
    "year": 2017,
    "bench": "5 Judge Bench",
    "full_text": "The case challenged the practice of triple talaq (instantaneous divorce in Muslim personal law). The Supreme Court by a 3-2 majority struck down triple talaq as unconstitutional. The majority held that triple talaq is manifestly arbitrary and violates Article 14 of the Constitution. The practice has no sanction in the Quran and is not an integral part of Islamic religious practice. This landmark judgment led to the enactment of the Muslim Women (Protection of Rights on Marriage) Act, 2019.",
    "source_url": "https://indiankanoon.org/doc/115701246/"
  },
  {
    "case_name": "Shreya Singhal v. Union of India",
    "citation": "AIR 2015 SC 1523",
    "year": 2015,
    "bench": "2 Judge Bench",
    "full_text": "The constitutionality of Section 66A of the Information Technology Act, 2000, which penalized sending offensive messages through communication devices, was challenged. The Supreme Court struck down Section 66A in its entirety as unconstitutional, holding it violated the right to free speech under Article 19(1)(a). The Court distinguished between discussion, advocacy, and incitement, holding that only the last category can be restricted. This was a landmark judgment for online free speech in India.",
    "source_url": "https://indiankanoon.org/doc/110813550/"
  },
  {
    "case_name": "Romesh Thappar v. State of Madras",
    "citation": "AIR 1950 SC 124",
    "year": 1950,
    "bench": "5 Judge Bench",
    "full_text": "The editor of a weekly journal challenged the ban on the entry of his publication into Madras state. The Supreme Court struck down the ban, holding that freedom of the press is an essential part of the right to freedom of speech and expression under Article 19(1)(a). The Court held that pre-censorship and restrictions on circulation amount to infringement of the liberty of the press. This was one of the earliest cases defining press freedom under the Constitution.",
    "source_url": "https://indiankanoon.org/doc/456839/"
  },
  {
    "case_name": "A.K. Gopalan v. State of Madras",
    "citation": "AIR 1950 SC 27",
    "year": 1950,
    "bench": "6 Judge Bench",
    "full_text": "A Communist leader detained under the Preventive Detention Act challenged his detention. The Supreme Court adopted a narrow interpretation, holding that Article 21 only required a procedure established by law, not that the procedure be fair or just. Each fundamental right was treated as a self-contained code. This restrictive interpretation was later overruled by Maneka Gandhi v. Union of India (1978), which held that Articles 14, 19, and 21 are interconnected and procedure must be fair, just, and reasonable.",
    "source_url": "https://indiankanoon.org/doc/1857950/"
  },
  {
    "case_name": "State of Madras v. Champakam Dorairajan",
    "citation": "AIR 1951 SC 226",
    "year": 1951,
    "bench": "7 Judge Bench",
    "full_text": "The case challenged the communal reservation order for admission to medical and engineering colleges in Madras state. The Supreme Court struck down the communal G.O. as violating Article 15(1) which prohibits discrimination on grounds of religion, race, caste, sex, or place of birth. The Court held that fundamental rights prevail over directive principles. This led to the First Amendment of the Constitution, inserting Article 15(4), which enabled special provisions for advancement of socially and educationally backward classes.",
    "source_url": "https://indiankanoon.org/doc/149321/"
  },
  {
    "case_name": "Golaknath v. State of Punjab",
    "citation": "AIR 1967 SC 1643",
    "year": 1967,
    "bench": "11 Judge Bench",
    "full_text": "The case challenged the validity of the Punjab Security of Land Tenures Act and the Constitution (Seventeenth Amendment) Act which placed this and other land reform laws in the Ninth Schedule. The Supreme Court by a 6-5 majority held that Parliament cannot amend fundamental rights under Article 368. The Court applied the doctrine of prospective overruling. This decision was later overruled by the Kesavananda Bharati case which allowed amendments to fundamental rights subject to the basic structure limitation.",
    "source_url": "https://indiankanoon.org/doc/120358/"
  },
  {
    "case_name": "Lily Thomas v. Union of India",
    "citation": "(2013) 7 SCC 653",
    "year": 2013,
    "bench": "2 Judge Bench",
    "full_text": "The case challenged the constitutional validity of Section 8(4) of the Representation of the People Act, 1951, which allowed convicted legislators to continue in office during the pendency of their appeal. The Supreme Court struck down Section 8(4), holding that it was unconstitutional as it created an artificial distinction between sitting members and prospective candidates. Convicted legislators would stand immediately disqualified upon conviction. This case was significant for electoral reforms and the decriminalization of politics.",
    "source_url": "https://indiankanoon.org/doc/67145595/"
  },
  {
    "case_name": "Aruna Ramchandra Shanbaug v. Union of India",
    "citation": "AIR 2011 SC 1290",
    "year": 2011,
    "bench": "2 Judge Bench",
    "full_text": "The case involved a nurse in vegetative state for 37 years following a sexual assault. The Supreme Court addressed the issue of euthanasia and the right to die with dignity. The Court distinguished between active and passive euthanasia, and allowed passive euthanasia under strict guidelines. The Court laid down a detailed procedure requiring High Court approval for withdrawal of life support. This judgment was later modified by the Common Cause case (2018) which recognized the right to die with dignity as a fundamental right.",
    "source_url": "https://indiankanoon.org/doc/235821/"
  },
  {
    "case_name": "Vellore Citizens Welfare Forum v. Union of India",
    "citation": "AIR 1996 SC 2715",
    "year": 1996,
    "bench": "3 Judge Bench",
    "full_text": "Tanneries in Tamil Nadu discharged untreated effluents into agricultural lands and the river Palar, devastating the environment. The Supreme Court applied the precautionary principle and the polluter pays principle as part of environmental law in India. The Court held that sustainable development is now a part of customary international law and can be applied in India. Industries were directed to set up pollution control facilities and compensate affected villagers. This case entrenched environmental principles into Indian constitutional law.",
    "source_url": "https://indiankanoon.org/doc/1934103/"
  },
  {
    "case_name": "Subhash Kumar v. State of Bihar",
    "citation": "AIR 1991 SC 420",
    "year": 1991,
    "bench": "2 Judge Bench",
    "full_text": "The petitioner alleged pollution of the Bokaro river by sludge from a washery, affecting drinking water supply. The Supreme Court held that the right to pollution-free water and air is encompassed within the right to life under Article 21. The Court observed that these are basic amenities necessary for life and that any contamination of air and water would be a slow poisoning of life, violating Article 21. This case expanded the environmental dimensions of fundamental rights.",
    "source_url": "https://indiankanoon.org/doc/1646284/"
  },
  {
    "case_name": "People's Union for Civil Liberties v. Union of India",
    "citation": "(2003) 4 SCC 399",
    "year": 2003,
    "bench": "2 Judge Bench",
    "full_text": "A writ petition was filed addressing mass starvation deaths despite surplus food grain stocks. The Supreme Court held that the right to food is a fundamental right under Article 21. The Court converted the benefits of various food schemes into legal entitlements. The Court appointed Commissioners to monitor implementation and issued extensive interim orders directing the government to ensure food security. This case was pivotal in the right to food movement and influenced the National Food Security Act, 2013.",
    "source_url": "https://indiankanoon.org/doc/1503831/"
  },
  {
    "case_name": "I.R. Coelho v. State of Tamil Nadu",
    "citation": "(2007) 2 SCC 1",
    "year": 2007,
    "bench": "9 Judge Bench",
    "full_text": "The case examined whether laws placed in the Ninth Schedule of the Constitution are immune from judicial review. The Supreme Court held that laws included in the Ninth Schedule after April 24, 1973 (the date of the Kesavananda Bharati judgment) are open to challenge if they violate the basic structure of the Constitution. The Court held that constitutional amendments inserting laws in the Ninth Schedule must be tested on the touchstone of basic structure. This case limited the use of the Ninth Schedule as a shield against judicial review.",
    "source_url": "https://indiankanoon.org/doc/1028841/"
  },
  {
    "case_name": "Ashoka Kumar Thakur v. Union of India",
    "citation": "(2008) 6 SCC 1",
    "year": 2008,
    "bench": "5 Judge Bench",
    "full_text": "The constitutional validity of the 93rd Amendment and the Central Educational Institutions (Reservation in Admission) Act 2006, providing 27% reservation for OBCs in higher educational institutions, was challenged. The Supreme Court upheld the OBC reservations but directed that the creamy layer among OBCs must be excluded. The Court held that caste alone cannot determine backwardness and economic criteria must also be considered. The Court also held that there shall be no reservation in postgraduate medical courses in super-specialties as it would compromise merit and patient safety.",
    "source_url": "https://indiankanoon.org/doc/1098800/"
  }
]
